// #############################################################################
// *****************************************************************************
//          Copyright (c) 2007-2008, WiMi-net (Beijing) Tech. Co., Ltd.
//      THIS IS AN UNPUBLISHED WORK CONTAINING CONFIDENTIAL AND PROPRIETARY
//         INFORMATION WHICH IS THE PROPERTY OF WIMI-NET TECH. CO., LTD.
//
//    ANY DISCLOSURE, USE, OR REPRODUCTION, WITHOUT WRITTEN AUTHORIZATION FROM
//               WIMI-NET TECH. CO., LTD, IS STRICTLY PROHIBITED.
// *****************************************************************************
// #############################################################################
//
// File:    message.h
// Author:  Mickle.ding
// Created: 1/22/2007
//
// Description:  Define the class message
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#ifndef _MESSAGE_INCLUDE_
#define _MESSAGE_INCLUDE_

// -----------------------------------------------------------------------------
// DESCRIPTION: 请求命令字的起始序号
// -----------------------------------------------------------------------------
#define CMDMSG_BASE                                            0X00

// -----------------------------------------------------------------------------
// DESCRIPTION: 应答命令字的起始序号
// -----------------------------------------------------------------------------
#define ACKMSG_BASE                                            0X80




// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备：请求命令字的起始序号
// -----------------------------------------------------------------------------
#define STORAGE_CMDBASE                                  ( CMDMSG_BASE + 0X00 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备：请求命令字的起始序号
// -----------------------------------------------------------------------------
#define COMMUTE_CMDBASE                                  ( CMDMSG_BASE + 0X10 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 人机交互类(Human Machine Interface)设备：请求命令字的起始序号
// -----------------------------------------------------------------------------
#define HMIVIEW_CMDBASE                                  ( CMDMSG_BASE + 0X40 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 输入输出类设备(A/D, D/A, GPIO)：请求命令字的起始序号
// -----------------------------------------------------------------------------
#define IOSPACE_CMDBASE                                  ( CMDMSG_BASE + 0X60 ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备：请求命令字的起始序号
// -----------------------------------------------------------------------------
#define MACHINE_CMDBASE                                  ( CMDMSG_BASE + 0X70 ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 请求命令字的上限
// -----------------------------------------------------------------------------
#define UPLIMIT_CMDBASE                                  ( CMDMSG_BASE + 0X80 ) 






// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备：应答命令字的起始序号
// -----------------------------------------------------------------------------
#define STORAGE_ACKBASE                   ( STORAGE_CMDBASE + ACKMSG_BASE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备：应答命令字的起始序号
// -----------------------------------------------------------------------------
#define COMMUTE_ACKBASE                   ( COMMUTE_CMDBASE + ACKMSG_BASE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 人机交互类设备：应答命令字的起始序号
// -----------------------------------------------------------------------------
#define HMIVIEW_ACKBASE                   ( HMIVIEW_CMDBASE + ACKMSG_BASE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 输入输出类设备：应答命令字的起始序号
// -----------------------------------------------------------------------------
#define IOSPACE_ACKBASE                   ( IOSPACE_CMDBASE + ACKMSG_BASE ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备：应答命令字的起始序号
// -----------------------------------------------------------------------------
#define MACHINE_ACKBASE                   ( MACHINE_CMDBASE + ACKMSG_BASE ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 应答命令字的上限
// -----------------------------------------------------------------------------
#define UPLIMIT_ACKBASE                   ( UPLIMIT_CMDBASE + ACKMSG_BASE )













// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：打开文件
// -----------------------------------------------------------------------------
#define CMDMSG_OPEN_FILE                  ( STORAGE_CMDBASE + 0X00 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字：打开文件
// -----------------------------------------------------------------------------
#define ACKMSG_OPEN_FILE                  ( ACKMSG_BASE | CMDMSG_OPEN_FILE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：关闭文件
// -----------------------------------------------------------------------------
#define CMDMSG_CLOSE_FILE                 ( STORAGE_CMDBASE + 0X01 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字：关闭文件
// -----------------------------------------------------------------------------
#define ACKMSG_CLOSE_FILE                 ( ACKMSG_BASE | CMDMSG_CLOSE_FILE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：设置文件长度
// -----------------------------------------------------------------------------
#define CMDMSG_SET_FILESIZE               ( STORAGE_CMDBASE + 0X02 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字：设置文件长度
// -----------------------------------------------------------------------------
#define ACKMSG_SET_FILESIZE               ( ACKMSG_BASE | CMDMSG_SET_FILESIZE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：读取文件长度
// -----------------------------------------------------------------------------
#define CMDMSG_GET_FILESIZE               ( STORAGE_CMDBASE + 0X03 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字: 读取文件长度
// -----------------------------------------------------------------------------
#define ACKMSG_GET_FILESIZE               ( ACKMSG_BASE | CMDMSG_GET_FILESIZE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：写入数据到本站点设备
// -----------------------------------------------------------------------------
#define CMDMSG_SET_DATA                   ( STORAGE_CMDBASE + 0X04 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字：写入数据到本站点设备
// -----------------------------------------------------------------------------
#define ACKMSG_SET_DATA                   ( ACKMSG_BASE | CMDMSG_SET_DATA )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：从本站点设备读取数据
// -----------------------------------------------------------------------------
#define CMDMSG_GET_DATA                   ( STORAGE_CMDBASE + 0X05 ) 

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#define ACKMSG_GET_DATA                   ( ACKMSG_BASE | CMDMSG_GET_DATA ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：格式化本站点／接收站点的输出设备
// -----------------------------------------------------------------------------
#define CMDMSG_FORMAT_MEDIA               ( STORAGE_CMDBASE + 0X06 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字：格式化本站点／接收站点的输出设备
// -----------------------------------------------------------------------------
#define ACKMSG_FORMAT_MEDIA               ( ACKMSG_BASE | CMDMSG_FORMAT_MEDIA )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的请求命令字：获得本站点存储媒体的相关信息
// -----------------------------------------------------------------------------
#define CMDMSG_GET_MEDIAINFO              ( STORAGE_CMDBASE + 0X07 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 存储类设备的应答命令字：获得本站点存储媒体的相关信息
// -----------------------------------------------------------------------------
#define ACKMSG_GET_MEDIAINFO              ( ACKMSG_BASE | CMDMSG_GET_MEDIAINFO ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置64位的MAC地址
// -----------------------------------------------------------------------------
#define CMDMSG_SET_X64MAC_ADDRESS         ( STORAGE_CMDBASE + 0X08 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置64位的MAC地址
// -----------------------------------------------------------------------------
#define ACKMSG_SET_X64MAC_ADDRESS         ( ACKMSG_BASE | CMDMSG_SET_X64MAC_ADDRESS ) 


// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取64位的MAC地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_X64MAC_ADDRESS         ( STORAGE_CMDBASE + 0X09 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取64位的MAC地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_X64MAC_ADDRESS         ( ACKMSG_BASE | CMDMSG_GET_X64MAC_ADDRESS ) 


// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置本机的网络接入点地址
// -----------------------------------------------------------------------------
#define CMDMSG_SET_HOST_NETWORK_AP			( STORAGE_CMDBASE + 0X0A )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置本机的网络接入点地址
// -----------------------------------------------------------------------------
#define ACKMSG_SET_HOST_NETWORK_AP			( ACKMSG_BASE | CMDMSG_SET_HOST_NETWORK_AP )


// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取本机的网络接入点地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_HOST_NETWORK_AP			( STORAGE_CMDBASE + 0X0B )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取本机的网络接入点地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_HOST_NETWORK_AP			( ACKMSG_BASE | CMDMSG_GET_HOST_NETWORK_AP )




// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置PANID(网络编号)
// -----------------------------------------------------------------------------
#define CMDMSG_SET_WIRELESS_PAN_ID        ( COMMUTE_CMDBASE + 0X00 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置PAN(网络编号)
// -----------------------------------------------------------------------------
#define ACKMSG_SET_WIRELESS_PAN_ID        ( ACKMSG_BASE | CMDMSG_SET_WIRELESS_PAN_ID )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取PAN(网络编号)
// -----------------------------------------------------------------------------
#define CMDMSG_GET_WIRELESS_PAN_ID        ( COMMUTE_CMDBASE + 0X01 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取PAN(网络编号)
// -----------------------------------------------------------------------------
#define ACKMSG_GET_WIRELESS_PAN_ID        ( ACKMSG_BASE | CMDMSG_SET_WIRELESS_PAN_ID )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置第一无线通讯频点
// -----------------------------------------------------------------------------
#define CMDMSG_SET_FREQUENCY_POINTX1      ( COMMUTE_CMDBASE + 0X02 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置第一无线通讯频点
// -----------------------------------------------------------------------------
#define ACKMSG_SET_FREQUENCY_POINTX1      ( ACKMSG_BASE | CMDMSG_SET_FREQUENCY_POINTX1 )



// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取第一无线通讯频点
// -----------------------------------------------------------------------------
#define CMDMSG_GET_FREQUENCY_POINTX1      ( COMMUTE_CMDBASE + 0X03 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取第一无线通讯频点
// -----------------------------------------------------------------------------
#define ACKMSG_GET_FREQUENCY_POINTX1      ( ACKMSG_BASE | CMDMSG_GET_FREQUENCY_POINTX1 )


// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取活动的接入点列表
// -----------------------------------------------------------------------------
#define CMDMSG_GET_ACTIVE_WIAP				( COMMUTE_CMDBASE + 0X04 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取活动的接入点列表
// -----------------------------------------------------------------------------
#define ACKMSG_GET_ACTIVE_WIAP				( ACKMSG_BASE | CMDMSG_GET_ACTIVE_WIAP )


// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：将从站点加入活动站点列表
// -----------------------------------------------------------------------------
#define CMDMSG_SET_NODE_ACTIVE            ( COMMUTE_CMDBASE + 0X06 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：将从站点加入活动站点列表
// -----------------------------------------------------------------------------
#define ACKMSG_SET_NODE_ACTIVE            ( ACKMSG_BASE | CMDMSG_SET_NODE_ACTIVE ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：将从站点从活动站点列表中删除
// -----------------------------------------------------------------------------
#define CMDMSG_SET_NODE_INACTIVE          ( COMMUTE_CMDBASE + 0X07 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：将从站点从活动站点列表中删除
// -----------------------------------------------------------------------------
#define ACKMSG_SET_NODE_INACTIVE          ( ACKMSG_BASE | CMDMSG_SET_NODE_INACTIVE ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取活动站点列表
// -----------------------------------------------------------------------------
#define CMDMSG_GET_ACTIVE_NODES           ( COMMUTE_CMDBASE + 0X08 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取活动站点列表
// -----------------------------------------------------------------------------
#define ACKMSG_GET_ACTIVE_NODES           ( ACKMSG_BASE | CMDMSG_GET_ACTIVE_NODES )


// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取站点列表的全部掩码信息
// -----------------------------------------------------------------------------
#define CMDMSG_GET_ALL_NODE_STATUS        ( COMMUTE_CMDBASE + 0X09 )            

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取站点列表的全部掩码信息
// -----------------------------------------------------------------------------
#define ACKMSG_GET_ALL_NODE_STATUS        ( ACKMSG_BASE | CMDMSG_GET_ALL_NODE_STATUS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置接收站点的ID号
// -----------------------------------------------------------------------------
#define CMDMSG_SET_PEER_ADDRESS           ( COMMUTE_CMDBASE + 0X0A )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置接收站点的ID号
// -----------------------------------------------------------------------------
#define ACKMSG_SET_PEER_ADDRESS           ( ACKMSG_BASE | CMDMSG_SET_PEER_ADDRESS ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取接收站点的ID号
// -----------------------------------------------------------------------------
#define CMDMSG_GET_PEER_ADDRESS           ( COMMUTE_CMDBASE + 0X0B )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取接收站点的ID号
// -----------------------------------------------------------------------------
#define ACKMSG_GET_PEER_ADDRESS           ( ACKMSG_BASE | CMDMSG_GET_PEER_ADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取发送队列的状态
// -----------------------------------------------------------------------------
#define CMDMSG_GET_FIFO_STATISTICS        ( COMMUTE_CMDBASE + 0X0C )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取发送队列的状态
// -----------------------------------------------------------------------------
#define ACKMSG_GET_FIFO_STATISTICS        ( ACKMSG_BASE | CMDMSG_GET_FIFO_STATISTICS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：发送数据报文
// -----------------------------------------------------------------------------
#define CMDMSG_TX_PACKET                  ( COMMUTE_CMDBASE + 0X0D )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：发送数据报文
// -----------------------------------------------------------------------------
#define ACKMSG_TX_PACKET                  ( ACKMSG_BASE | CMDMSG_TX_PACKET )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：接收数据报文
// -----------------------------------------------------------------------------
#define CMDMSG_RX_PACKET                  ( COMMUTE_CMDBASE + 0X0E ) 

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：接收数据报文
// -----------------------------------------------------------------------------
#define ACKMSG_RX_PACKET                  ( ACKMSG_BASE | CMDMSG_RX_PACKET )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取1号调试报文
// -----------------------------------------------------------------------------
#define CMDMSG_DEBUG_EVENT1               ( COMMUTE_CMDBASE + 0X0F )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置无线设备的模式
// -----------------------------------------------------------------------------
#define CMDMSG_SET_WIMODE                 ( COMMUTE_CMDBASE + 0X10 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置无线设备的模式
// -----------------------------------------------------------------------------
#define ACKMSG_SET_WIMODE                 ( ACKMSG_BASE | CMDMSG_SET_WIMODE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取无线设备的模式
// -----------------------------------------------------------------------------
#define CMDMSG_GET_WIMODE                 ( COMMUTE_CMDBASE + 0X11 )  

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取无线设备的模式
// -----------------------------------------------------------------------------
#define ACKMSG_GET_WIMODE                 ( ACKMSG_BASE | CMDMSG_GET_WIMODE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：使本站点断开和接收站点的连接
// -----------------------------------------------------------------------------
#define CMDMSG_SHUTDOWN_NETWORK           ( COMMUTE_CMDBASE + 0X12 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：使本站点断开和接收站点的连接
// -----------------------------------------------------------------------------
#define ACKMSG_SHUTDOWN_NETWORK           ( ACKMSG_BASE | CMDMSG_SHUTDOWN_NETWORK )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取节点的状态
// -----------------------------------------------------------------------------
#define CMDMSG_QUERY_NODESTATUS           ( COMMUTE_CMDBASE + 0X13 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取节点的状态
// -----------------------------------------------------------------------------
#define ACKMSG_QUERY_NODESTATUS           ( ACKMSG_BASE | CMDMSG_QUERY_NODESTATUS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：
//             启动/停止通讯报文监控，使能/禁止网络中心站点从串口输出运行信息
// -----------------------------------------------------------------------------
#define CMDMSG_DEBUG_MESSAGE              ( COMMUTE_CMDBASE + 0X15 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：
//              启动/停止通讯报文监控，使能/禁止网络中心站点从串口输出运行信息
// -----------------------------------------------------------------------------
#define ACKMSG_DEBUG_MESSAGE              ( ACKMSG_BASE | CMDMSG_DEBUG_MESSAGE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：
//              启动/停止网络中心站点，使能/禁止站点从串口输出运行信息和数据报文
// -----------------------------------------------------------------------------
#define CMDMSG_HALT_MACHINE               ( COMMUTE_CMDBASE + 0X16 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：
//              启动/停止网络中心站点，使能/禁止站点从串口输出运行信息和数据报文
// -----------------------------------------------------------------------------
#define ACKMSG_HALT_MACHINE               ( ACKMSG_BASE | CMDMSG_HALT_MACHINE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：
//              串口同步请求，要求接收端应答，确认串口处于物理连接状态
// -----------------------------------------------------------------------------
#define CMDMSG_UART_SYNC_1ST_REQ          ( COMMUTE_CMDBASE + 0X17 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求应答字：
//              串口同步应答，确认串口同步请求
// -----------------------------------------------------------------------------
#define CMDMSG_UART_SYNC_REQ_ACK          ( COMMUTE_CMDBASE + 0X18 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求应答字：
//              串口同步二次应答，确认串口同步应答
// -----------------------------------------------------------------------------
#define CMDMSG_UART_SYNC_2ND_ACK          ( COMMUTE_CMDBASE + 0X19 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置无线通讯的信道速率
// -----------------------------------------------------------------------------
#define CMDMSG_SET_RFSPEED                ( COMMUTE_CMDBASE + 0X1A )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置无线通讯的信道速率
// -----------------------------------------------------------------------------
#define ACKMSG_SET_RFSPEED                ( ACKMSG_BASE | CMDMSG_SET_RFSPEED )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取无线通讯的信道速率
// -----------------------------------------------------------------------------
#define CMDMSG_GET_RFSPEED                ( COMMUTE_CMDBASE + 0X1B )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取无线通讯的信道速率
// -----------------------------------------------------------------------------
#define ACKMSG_GET_RFSPEED                ( ACKMSG_BASE | CMDMSG_GET_RFSPEED )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置本机节点的16位地址
// -----------------------------------------------------------------------------
#define CMDMSG_SET_NODE_TX_ADDRESS        ( COMMUTE_CMDBASE + 0X1C )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置本机节点的16位地址
// -----------------------------------------------------------------------------
#define ACKMSG_SET_NODE_TX_ADDRESS        ( ACKMSG_BASE | CMDMSG_SET_NODE_TX_ADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取本机节点的16位地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_NODE_TX_ADDRESS        ( COMMUTE_CMDBASE + 0X1D )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取本机节点的16位地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_NODE_TX_ADDRESS        ( ACKMSG_BASE | CMDMSG_GET_NODE_TX_ADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：选择最优的无线基站
// -----------------------------------------------------------------------------
#define CMDMSG_SELECT_OPTIMAL_WIAP        ( COMMUTE_CMDBASE + 0X1F )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：选择最优的无线基站
// -----------------------------------------------------------------------------
#define ACKMSG_SELECT_OPTIMAL_WIAP        ( ACKMSG_BASE | CMDMSG_SELECT_OPTIMAL_WIAP )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取2号调试报文
// -----------------------------------------------------------------------------
#define CMDMSG_DEBUG_EVENT2               ( COMMUTE_CMDBASE + 0X20 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求应答字：
//              无线通讯的信号强度信息
// -----------------------------------------------------------------------------
#define CMDMSG_WIRELESS_SINAL_PROFILE     ( COMMUTE_CMDBASE + 0X21 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答应答字：
//              无线通讯的信号强度信息
// -----------------------------------------------------------------------------
#define ACKMSG_WIRELESS_SINAL_PROFILE     ( ACKMSG_BASE | CMDMSG_WIRELESS_SINAL_PROFILE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置第二无线通讯频点
// -----------------------------------------------------------------------------
#define CMDMSG_SET_FREQUENCY_POINTX2      ( COMMUTE_CMDBASE + 0X22 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置第二无线通讯频点
// -----------------------------------------------------------------------------
#define ACKMSG_SET_FREQUENCY_POINTX2      ( ACKMSG_BASE | CMDMSG_SET_FREQUENCY_POINTX2 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取第二无线通讯频点
// -----------------------------------------------------------------------------
#define CMDMSG_GET_FREQUENCY_POINTX2      ( COMMUTE_CMDBASE + 0X23 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置接收衰减
// -----------------------------------------------------------------------------
#define CMDMSG_SET_RX_ATTENUATION         ( COMMUTE_CMDBASE + 0X24 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置接收衰减
// -----------------------------------------------------------------------------
#define ACKMSG_SET_RX_ATTENUATION         ( ACKMSG_BASE | CMDMSG_SET_RX_ATTENUATION )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取接收衰减状态
// -----------------------------------------------------------------------------
#define CMDMSG_GET_RX_ATTENUATION         ( COMMUTE_CMDBASE + 0X25 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取接收衰减状态
// -----------------------------------------------------------------------------
#define ACKMSG_GET_RX_ATTENUATION         ( ACKMSG_BASE | CMDMSG_GET_RX_ATTENUATION )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取第二无线通讯频点
// -----------------------------------------------------------------------------
#define ACKMSG_GET_FREQUENCY_POINTX2      ( ACKMSG_BASE | CMDMSG_GET_FREQUENCY_POINTX2 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置设备的IP地址
// -----------------------------------------------------------------------------
#define CMDMSG_SET_IPADDRESS              ( COMMUTE_CMDBASE + 0X26 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置设备的IP地址
// -----------------------------------------------------------------------------
#define ACKMSG_SET_IPADDRESS              ( ACKMSG_BASE | CMDMSG_SET_IPADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取设备的IP地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_IPADDRESS              ( COMMUTE_CMDBASE + 0X27 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取设备的IP地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_IPADDRESS              ( ACKMSG_BASE | CMDMSG_GET_IPADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置串口的波特率
// -----------------------------------------------------------------------------
#define CMDMSG_SET_BAUDRATE               ( COMMUTE_CMDBASE + 0X28 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置串口的波特率
// -----------------------------------------------------------------------------
#define ACKMSG_SET_BAUDRATE               ( ACKMSG_BASE | CMDMSG_SET_BAUDRATE )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：搜索无线网络节点
// -----------------------------------------------------------------------------
#define CMDMSG_SEARCH_WINET               ( COMMUTE_CMDBASE + 0X29 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：搜索无线网络节点
// -----------------------------------------------------------------------------
#define ACKMSG_SEARCH_WINET               ( ACKMSG_BASE | CMDMSG_SEARCH_WINET )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置PA功率的大小
// -----------------------------------------------------------------------------
#define CMDMSG_SET_PA_INDEX               ( COMMUTE_CMDBASE + 0X2A )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置本站点／接收站点的接收设备
// -----------------------------------------------------------------------------
#define ACKMSG_SET_PA_INDEX               ( ACKMSG_BASE | CMDMSG_SET_PA_INDEX )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取PA功率的大小
// -----------------------------------------------------------------------------
#define CMDMSG_GET_PA_INDEX               ( COMMUTE_CMDBASE + 0X2B )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取PA功率的大小
// -----------------------------------------------------------------------------
#define ACKMSG_GET_PA_INDEX               ( ACKMSG_BASE | CMDMSG_GET_PA_INDEX )

// -----------------------------------------------------------------------------
// DESCRIPTION:  通讯类设备的请求命令字：设置频率扫描的工作频点
// -----------------------------------------------------------------------------
#define CMDMSG_SET_NETSCAN_CHANNEL        ( COMMUTE_CMDBASE + 0X2C )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置频率扫描的工作频点
// -----------------------------------------------------------------------------
#define ACKMSG_SET_NETSCAN_CHANNEL        ( ACKMSG_BASE | CMDMSG_SET_NETSCAN_CHANNEL )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取频率扫描的工作频点
// -----------------------------------------------------------------------------
#define CMDMSG_GET_NETSCAN_CHANNEL        ( COMMUTE_CMDBASE + 0X2D )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取频率扫描的工作频点
// -----------------------------------------------------------------------------
#define ACKMSG_GET_NETSCAN_CHANNEL        ( ACKMSG_BASE | CMDMSG_GET_NETSCAN_CHANNEL )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：设置频率扫描的掩码
// -----------------------------------------------------------------------------
#define CMDMSG_SET_NETSCAN_MASKID         ( COMMUTE_CMDBASE | 0X2E )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：设置频率扫描的掩码
// -----------------------------------------------------------------------------
#define ACKMSG_SET_NETSCAN_MASKID         ( ACKMSG_BASE | CMDMSG_SET_NETSCAN_MASKID )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的请求命令字：读取频率扫描的掩码
// -----------------------------------------------------------------------------
#define CMDMSG_GET_NETSCAN_MASKID         ( COMMUTE_CMDBASE + 0X2F )

// -----------------------------------------------------------------------------
// DESCRIPTION: 通讯类设备的应答命令字：读取频率扫描的掩码
// -----------------------------------------------------------------------------
#define ACKMSG_GET_NETSCAN_MASKID         ( ACKMSG_BASE | CMDMSG_GET_NETSCAN_MASKID )







// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取Firmware的版本号
// -----------------------------------------------------------------------------
#define CMDMSG_GET_FIRMWARE_VERSION       ( MACHINE_CMDBASE + 0X00 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取Firmware的版本号
// -----------------------------------------------------------------------------
#define ACKMSG_GET_FIRMWARE_VERSION       ( ACKMSG_BASE | CMDMSG_GET_FIRMWARE_VERSION )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：设置无线访问的密码
// -----------------------------------------------------------------------------
#define CMDMSG_SET_ADMIN_PASSWORD         ( MACHINE_CMDBASE + 0X01 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：设置无线访问的密码
// -----------------------------------------------------------------------------
#define ACKMSG_SET_ADMIN_PASSWORD         ( ACKMSG_BASE | CMDMSG_SET_ADMIN_PASSWORD )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：设置节点访问的安全等级
// -----------------------------------------------------------------------------
#define CMDMSG_SET_SECURITY_LEVEL         ( MACHINE_CMDBASE + 0X02 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：设置节点访问的安全等级
// -----------------------------------------------------------------------------
#define ACKMSG_SET_SECURITY_LEVEL         ( ACKMSG_BASE | CMDMSG_SET_SECURITY_LEVEL )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：设置节点访问的安全等级
// -----------------------------------------------------------------------------
#define CMDMSG_GET_SECURITY_LEVEL         ( MACHINE_CMDBASE + 0X03 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：设置节点访问的安全等级
// -----------------------------------------------------------------------------
#define ACKMSG_GET_SECURITY_LEVEL         ( ACKMSG_BASE | CMDMSG_GET_SECURITY_LEVEL )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取节点的父节点地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_PARENT_ADDRESS         ( MACHINE_CMDBASE + 0X04 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取节点的父节点的地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_PARENT_ADDRESS         ( ACKMSG_BASE | CMDMSG_GET_PARENT_ADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取节点的父节点地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_MEMBER_ADDRESS         ( MACHINE_CMDBASE + 0X05 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取节点的父节点的地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_MEMBER_ADDRESS         ( ACKMSG_BASE | CMDMSG_GET_MEMBER_ADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取根节点地址
// -----------------------------------------------------------------------------
#define CMDMSG_GET_COORDINATOR_ID         ( MACHINE_CMDBASE + 0X06 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取根节点的地址
// -----------------------------------------------------------------------------
#define ACKMSG_GET_COORDINATOR_ID         ( ACKMSG_BASE | CMDMSG_GET_COORDINATOR_ID )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取无线模块的运行状态
// -----------------------------------------------------------------------------
#define CMDMSG_GET_WMODULE_STATUS         ( MACHINE_CMDBASE + 0X07 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取无线模块的运行状态
// -----------------------------------------------------------------------------
#define ACKMSG_GET_WMODULE_STATUS         ( ACKMSG_BASE | CMDMSG_GET_WMODULE_STATUS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取无线模块的网络状态
// -----------------------------------------------------------------------------
#define CMDMSG_GET_NETWORK_STATUS         ( MACHINE_CMDBASE + 0X08 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取无线模块的网络状态
// -----------------------------------------------------------------------------
#define ACKMSG_GET_NETWORK_STATUS         ( ACKMSG_BASE | CMDMSG_GET_NETWORK_STATUS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：读取无线模块至中心节点的跳数
// -----------------------------------------------------------------------------
#define CMDMSG_GET_MESH_CENTER_HOP         ( MACHINE_CMDBASE + 0X09 )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：读取无线模块至中心节点的跳数
// -----------------------------------------------------------------------------
#define ACKMSG_GET_MESH_CENTER_HOP         ( ACKMSG_BASE | CMDMSG_GET_MESH_CENTER_HOP )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：16位节点地址转换成MAC地址
// -----------------------------------------------------------------------------
#define CMDMSG_NODE_ADDRESS_TO_MAC         ( MACHINE_CMDBASE + 0X0A )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：16位节点地址转换成MAC地址
// -----------------------------------------------------------------------------
#define ACKMSG_NODE_ADDRESS_TO_MAC         ( ACKMSG_BASE | CMDMSG_NODE_ADDRESS_TO_MAC )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的请求命令字：16位节点地址转换成MAC地址
// -----------------------------------------------------------------------------
#define CMDMSG_MAC_TO_NODE_ADDRESS         ( MACHINE_CMDBASE + 0X0B )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：MAC节点地址转换成16位地址
// -----------------------------------------------------------------------------
#define ACKMSG_MAC_TO_NODE_ADDRESS         ( ACKMSG_BASE | CMDMSG_MAC_TO_NODE_ADDRESS )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：查询设备的注册信息
// -----------------------------------------------------------------------------
#define CMDMSG_QUERY_NODE_REG_INFO        ( MACHINE_CMDBASE + 0X0C )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：查询设备的注册信息
// -----------------------------------------------------------------------------
#define ACKMSG_QUERY_NODE_REG_INFO        ( ACKMSG_BASE | CMDMSG_QUERY_NODE_REG_INFO )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：查询节点的网络路由表
// -----------------------------------------------------------------------------
#define CMDMSG_QUERY_WIMINET_PATH         ( MACHINE_CMDBASE + 0X0D )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：查询节点的网络路由表
// -----------------------------------------------------------------------------
#define ACKMSG_QUERY_WIMINET_PATH         ( ACKMSG_BASE | CMDMSG_QUERY_WIMINET_PATH )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：查询节点的网络信号强度
// -----------------------------------------------------------------------------
#define CMDMSG_QUERY_NETWORK_RSSI         ( MACHINE_CMDBASE + 0X0E )

// -----------------------------------------------------------------------------
// DESCRIPTION: 其他类设备的应答命令字：查询节点的网络路由表
// -----------------------------------------------------------------------------
#define ACKMSG_QUERY_NETWORK_RSSI         ( ACKMSG_BASE | CMDMSG_QUERY_NETWORK_RSSI )



// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为存储类设备的请求命令字
// -----------------------------------------------------------------------------
#define IS_CMDMSG_STORAGE( iMsg )                                             \
            ( ( ( iMsg ) >= STORAGE_CMDBASE ) && ( ( iMsg ) < COMMUTE_CMDBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为通讯类设备的请求命令字
// -----------------------------------------------------------------------------
#define IS_CMDMSG_COMMUTE( iMsg )                                             \
            ( ( ( iMsg ) >= COMMUTE_CMDBASE ) && ( ( iMsg ) < HMIVIEW_CMDBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为人机交互类设备的请求命令字
// -----------------------------------------------------------------------------
#define IS_CMDMSG_HMIVIEW( iMsg )                                             \
            ( ( ( iMsg ) >= HMIVIEW_CMDBASE ) && ( ( iMsg ) < IOSPACE_CMDBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为IO输入输出类设备的请求命令字
// -----------------------------------------------------------------------------
#define IS_CMDMSG_IOSPACE( iMsg )                                             \
            ( ( ( iMsg ) >= IOSPACE_CMDBASE ) && ( ( iMsg ) < MACHINE_CMDBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为其他类设备的请求命令字
// -----------------------------------------------------------------------------
#define IS_CMDMSG_MACHINE( iMsg )                                             \
            ( ( ( iMsg ) >= MACHINE_CMDBASE ) && ( ( iMsg ) < UPLIMIT_CMDBASE ) ) 


// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为以太网络类设备的请求命令字
// -----------------------------------------------------------------------------
#define IS_CMDMSG_NETWORK( iMsg )                                             \
( ( ( iMsg ) >= CMDMSG_SET_IPADDRESS ) && ( ( iMsg ) <= CMDMSG_GET_IPADDRESS ) )


// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否是数据传送的请求报文
// -----------------------------------------------------------------------------
#define IS_CMDMSG_PACKETS( iMsg )                                             \
            ( ( ( iMsg ) == CMDMSG_TX_PACKET ) || ( ( iMsg ) == CMDMSG_RX_PACKET ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否是数据传送的应答报文
// -----------------------------------------------------------------------------
#define IS_ACKMSG_PACKETS( iMsg )                                             \
            ( ( ( iMsg ) == ACKMSG_TX_PACKET ) || ( ( iMsg ) == ACKMSG_RX_PACKET ) )  



// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为存储类设备的应答命令字
// -----------------------------------------------------------------------------
#define IS_ACKMSG_STORAGE( iMsg )                                             \
            ( ( ( iMsg ) >= STORAGE_ACKBASE ) && ( ( iMsg ) < COMMUTE_ACKBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为通讯类设备的应答命令字
// -----------------------------------------------------------------------------
#define IS_ACKMSG_COMMUTE( iMsg )                                             \
            ( ( ( iMsg ) >= COMMUTE_ACKBASE ) && ( ( iMsg ) < HMIVIEW_ACKBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为人机交互类设备的应答命令字
// -----------------------------------------------------------------------------
#define IS_ACKMSG_HMIVIEW( iMsg )                                             \
            ( ( ( iMsg ) >= HMIVIEW_ACKBASE ) && ( ( iMsg ) < IOSPACE_ACKBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为IO输入输出类设备的应答命令字
// -----------------------------------------------------------------------------
#define IS_ACKMSG_IOSPACE( iMsg )                                             \
            ( ( ( iMsg ) >= IOSPACE_ACKBASE ) && ( ( iMsg ) < MACHINE_ACKBASE ) )

// -----------------------------------------------------------------------------
// DESCRIPTION: 判断命令字是否为其他类设备的应答命令字
// -----------------------------------------------------------------------------
#define IS_ACKMSG_MACHINE( iMsg )                                             \
            ( ( ( iMsg ) >= MACHINE_ACKBASE ) && ( ( iMsg ) < UPLIMIT_ACKBASE ) ) 


// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#if defined ( __CC_ARM ) 

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#pragma push

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#pragma pack( 1 )

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#endif

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
typedef struct _NodeMsg
{
   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iHeader;

   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iOpCode;

   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iValueA;

   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iValueB;
   
   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iValueC;

   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iValueD;
   
   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_iAmount;  

   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned short                                              m_iCRCode;

   // --------------------------------------------------------------------------
   // DESCRIPTION:
   // --------------------------------------------------------------------------
   unsigned char                                               m_pBuffer[246]; 
   
} NodeMsg;

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#if defined ( __CC_ARM ) 

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#pragma pop

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#endif

// -----------------------------------------------------------------------------
// DESCRIPTION: 是否是一个有效的报文，该报文必须有同步字符并且CRC验算正确
// -----------------------------------------------------------------------------
unsigned char IsValidNodeMsg( NodeMsg * pMsg );

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
void UpdateNodeMsgCRC( NodeMsg * pMsg );

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
void WriteNodeMsg( unsigned char hFile, NodeMsg * pMsg );

// -----------------------------------------------------------------------------
// DESCRIPTION:
// -----------------------------------------------------------------------------
#endif
